{"keras_version": "2.2.4", "config": {"name": "sequential_10", "layers": [{"config": {"trainable": true, "batch_input_shape": [null, 10109, 1], "filters": 256, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "relu", "kernel_constraint": null, "data_format": "channels_last", "bias_constraint": null, "strides": [1], "dilation_rate": [1], "dtype": "float32", "bias_regularizer": null, "use_bias": true, "kernel_regularizer": null, "kernel_size": [5], "padding": "same", "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "name": "conv1d_5"}, "class_name": "Conv1D"}, {"config": {"trainable": true, "name": "max_pooling1d_5", "pool_size": [4], "padding": "valid", "data_format": "channels_last", "strides": [4]}, "class_name": "MaxPooling1D"}, {"config": {"recurrent_activation": "hard_sigmoid", "go_backwards": false, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "activation": "tanh", "implementation": 1, "recurrent_constraint": null, "bias_regularizer": null, "use_bias": true, "name": "lstm_13", "activity_regularizer": null, "recurrent_dropout": 0.0, "trainable": true, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "return_sequences": false, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "unit_forget_bias": true, "bias_constraint": null, "unroll": false, "kernel_regularizer": null, "stateful": false, "recurrent_regularizer": null, "dropout": 0.0, "units": 64, "return_state": false}, "class_name": "LSTM"}, {"config": {"trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "linear", "kernel_constraint": null, "bias_constraint": null, "kernel_regularizer": null, "bias_regularizer": null, "use_bias": true, "name": "dense_7", "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "units": 10109}, "class_name": "Dense"}]}, "backend": "tensorflow", "class_name": "Sequential"}