{"keras_version": "2.2.4", "config": {"name": "sequential_5", "layers": [{"config": {"activation": "tanh", "go_backwards": false, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "recurrent_activation": "hard_sigmoid", "implementation": 1, "recurrent_constraint": null, "stateful": false, "bias_regularizer": null, "use_bias": true, "name": "lstm_8", "recurrent_dropout": 0.0, "trainable": true, "batch_input_shape": [null, 2987, 1], "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "return_sequences": false, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "unit_forget_bias": true, "bias_constraint": null, "unroll": false, "kernel_regularizer": null, "dtype": "float32", "activity_regularizer": null, "recurrent_regularizer": null, "dropout": 0.0, "units": 128, "return_state": false}, "class_name": "LSTM"}, {"config": {"trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "linear", "kernel_constraint": null, "bias_constraint": null, "kernel_regularizer": null, "bias_regularizer": null, "use_bias": true, "name": "dense_2", "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "units": 2987}, "class_name": "Dense"}]}, "backend": "tensorflow", "class_name": "Sequential"}